Repository: Badboyzzzzzzzzzz/palm_restaurant
Catalog: lib/l10n/app_*.arb
Languages: km

# appTitle
source: PALM Restaurant
km: ភោជនីយដ្ឋាន PALM

source: Welcome
km: សូមស្វាគមន៍

source: Login
km: ចូល

source: Sign Up
km: ចុះឈ្មោះ

source: Email
km: អ៊ីមែល

source: Password
km: ពាក្យសម្ងាត់

source: Confirm Password
km: បញ្ជាក់ពាក្យសម្ងាត់

source: Forgot Password?
km: ភ្លេចពាក្យសម្ងាត់?

source: Home
km: ទំព័រដើម

source: Categories
km: ប្រភេទ

source: Cart
km: រទេះ

source: Orders
km: ការកម្មង់

source: Profile
km: គណនី

source: Favorites
km: ចំណូលចិត្ត

source: Notifications
km: ការជូនដំណឹង

source: Search
km: ស្វែងរក

source: Add to Cart
km: បន្ថែមទៅរទេះ

source: Remove from Cart
km: ដកចេញពីរទេះ

source: Checkout
km: គិតលុយ

source: Total
km: សរុប

source: Subtotal
km: សរុបរង

source: Tax
km: ពន្ធ

source: Delivery Fee
km: ថ្លៃដឹកជញ្ជូន

source: Order Total
km: សរុបការកម្មង់

source: Payment Method
km: វិធីទូទាត់

source: Delivery Address
km: អាសយដ្ឋានដឹកជញ្ជូន

source: Confirm Order
km: បញ្ជាក់ការកម្មង់

source: Order Confirmed
km: ការកម្មង់ត្រូវបានបញ្ជាក់

source: Order Status
km: ស្ថានភាពការកម្មង់

source: Pending
km: កំពុងរង់ចាំ

source: Confirmed
km: បានបញ្ជាក់

source: Preparing
km: កំពុងរៀបចំ

source: On the Way
km: កំពុងដឹកជញ្ជូន

source: Delivered
km: បានដឹកជញ្ជូន

source: Cancelled
km: បានលុបចោល

source: Settings
km: ការកំណត់

source: Language
km: ភាសា

source: Theme
km: រចនាបថ

source: Dark Mode
km: រចនាបថងងឹត

source: Light Mode
km: រចនាបថភ្លឺ

source: About
km: អំពី

source: Contact
km: ទំនាក់ទំនង

source: Help
km: ជំនួយ

source: Logout
km: ចាកចេញ

source: Edit Profile
km: កែប្រែគណនី

source: Save
km: រក្សាទុក

source: Cancel
km: បោះបង់

source: Delete
km: លុប

source: Yes
km: បាទ/ចាស

source: No
km: ទេ

source: OK
km: យល់ព្រម

source: Error
km: កំហុស

source: Success
km: ជោគជ័យ

source: Loading...
km: កំពុងផ្ទុក...

source: Retry
km: ព្យាយាមម្តងទៀត

# noInternet
source: No Internet Connection
km: គ្មានការតភ្ជាប់អ៊ីនធឺណិត

source: Try Again
km: ព្យាយាមម្តងទៀត

source: Best Seller
km: លក់ដាច់បំផុត

source: New Arrival
km: ថ្មី

source: Recommended
km: ណែនាំ

source: View All
km: មើលទាំងអស់

source: Quantity
km: បរិមាណ

source: Price
km: តម្លៃ

source: Description
km: ការពិពណ៌នា

source: Ingredients
km: គ្រឿងផ្សំ

source: Allergens
km: អាលែរហ្សែន

# nutritionalInfo
source: Nutritional Information
km: ព័ត៌មានអាហារូបត្ថម្ភ

source: Reviews
km: ការវាយតម្លៃ

source: Rating
km: ការវាយតម្លៃ

# writeReview
source: Write a Review
km: សរសេរការវាយតម្លៃ

source: Submit
km: ដាក់ស្នើ

source: Phone Number
km: លេខទូរស័ព្ទ

source: Address
km: អាសយដ្ឋាន

source: City
km: ទីក្រុង

source: State
km: ខេត្ត

source: Zip Code
km: កូដប្រៃសណីយ៍

source: Country
km: ប្រទេស

source: Select Location
km: ជ្រើសរើសទីតាំង

source: Use Current Location
km: ប្រើទីតាំងបច្ចុប្បន្ន

source: Order History
km: ប្រវត្តិការកម្មង់

source: Order Details
km: ព័ត៌មានលម្អិតការកម្មង់

source: Order Number
km: លេខការកម្មង់

source: Order Date
km: កាលបរិច្ឆេទការកម្មង់

source: Estimated Delivery
km: កាលបរិច្ឆេទដឹកជញ្ជូនប៉ាន់ស្មាន

source: Track Order
km: តាមដានការកម្មង់

source: Rate Order
km: វាយតម្លៃការកម្មង់

source: Reorder
km: កម្មង់ម្តងទៀត

source: Share Order
km: ចែករំលែកការកម្មង់

source: Promo Code
km: កូដផ្តាច់

source: Apply
km: អនុវត្ត

source: Discount
km: ការបញ្ចុះតម្លៃ

source: Free Delivery
km: ដឹកជញ្ជូនឥតគិតថ្លៃ

source: Minimum Order
km: ការកម្មង់អប្បបរមា

source: Delivery Time
km: ពេលវេលាដឹកជញ្ជូន

source: minutes
km: នាទី

source: hours
km: ម៉ោង

source: days
km: ថ្ងៃ

source: Cash on Delivery
km: ប្រាក់ពេលទទួល

source: Credit Card
km: កាតឥណទាន

source: Debit Card
km: កាតឥណវិក

source: Digital Wallet
km: កាបូបឌីជីថល

source: Bank Transfer
km: ការផ្ទេរធនាគារ

source: QR Code
km: កូដ QR

source: Scan QR Code
km: ស្កេនកូដ QR

source: Payment Successful
km: ការទូទាត់ជោគជ័យ

source: Payment Failed
km: ការទូទាត់បរាជ័យ

source: Thank You
km: សូមអភ័យទោស

# orderPlaced
source: Your order has been placed successfully!
km: ការកម្មង់របស់អ្នកត្រូវបានដាក់ជាប់យ៉ាងជោគជ័យ!

# orderTracking
source: You can track your order in the orders section.
km: អ្នកអាចតាមដានការកម្មង់របស់អ្នកនៅក្នុងផ្នែកការកម្មង់។

source: Continue Shopping
km: បន្តទិញ

# emptyCart
source: Your cart is empty
km: រទេះរបស់អ្នកទទេ

# emptyCartMessage
source: Add some delicious items to your cart to get started!
km: បន្ថែមវត្ថុឆ្ងាញ់ៗទៅក្នុងរទេះរបស់អ្នកដើម្បីចាប់ផ្តើម!

# emptyFavorites
source: No favorites yet
km: គ្មានចំណូលចិត្តនៅឡើយទេ

# emptyFavoritesMessage
source: Start adding your favorite dishes to this list!
km: ចាប់ផ្តើមបន្ថែមម្ហូបចំណូលចិត្តរបស់អ្នកទៅក្នុងបញ្ជីនេះ!

# emptyOrders
source: No orders yet
km: គ្មានការកម្មង់នៅឡើយទេ

# emptyOrdersMessage
source: Your order history will appear here once you place an order.
km: ប្រវត្តិការកម្មង់របស់អ្នកនឹងបង្ហាញនៅទីនេះនៅពេលអ្នកដាក់ការកម្មង់។

source: No notifications
km: គ្មានការជូនដំណឹង

# noNotificationsMessage
source: You're all caught up! New notifications will appear here.
km: អ្នកបានធ្វើរួចហើយ! ការជូនដំណឹងថ្មីនឹងបង្ហាញនៅទីនេះ។

# noSearchResults
source: No results found
km: រកមិនឃើញលទ្ធផល

# noSearchResultsMessage
source: Try adjusting your search terms or browse our categories.
km: ព្យាយាមកែតម្រូវពាក្យស្វែងរករបស់អ្នក ឬរុករកប្រភេទរបស់យើង។

source: Filter
km: តម្រង

source: Sort
km: តម្រៀប

source: Sort by
km: តម្រៀបតាម

source: Price: Low to High
km: តម្លៃ: ទាបទៅខ្ពស់

source: Price: High to Low
km: តម្លៃ: ខ្ពស់ទៅទាប

# nameAZ
source: Name: A to Z
km: ឈ្មោះ: A ទៅ Z

# nameZA
source: Name: Z to A
km: ឈ្មោះ: Z ទៅ A

source: Popularity
km: ភាពពេញនិយម

source: Newest
km: ថ្មីបំផុត

source: Oldest
km: ចាស់បំផុត

source: Clear Filters
km: សម្អាតតម្រង

source: Apply Filters
km: អនុវត្តតម្រង

source: Price Range
km: ចន្លោះតម្លៃ

source: Category
km: ប្រភេទ

source: Cuisine
km: អាហារ

source: Dietary
km: អាហារូបត្ថម្ភ

source: Vegetarian
km: អាហារបណ្តុះ

source: Vegan
km: អាហារបណ្តុះសុទ្ធ

source: Gluten Free
km: គ្មានគ្លុយតិន

source: Halal
km: ហាឡាល់

source: Spicy
km: ហឹរ

source: Non-Spicy
km: មិនហឹរ

source: Breakfast
km: អាហារព្រឹក

source: Lunch
km: អាហារថ្ងៃត្រង់

source: Dinner
km: អាហារល្ងាច

source: Dessert
km: បង្អែម

source: Beverage
km: ភេសជ្ជៈ

source: Appetizer
km: អាហារចាប់ផ្តើម

source: Main Course
km: មុខម្ហូបគោល

source: Side Dish
km: មុខម្ហូបបន្ថែម

source: Soup
km: ស៊ុប

source: Salad
km: សាឡាដ

source: Pizza
km: ភីហ្សា

source: Burger
km: ប៊ឺហ្គឺ

source: Pasta
km: ប៉ាស្តា

source: Rice
km: បាយ

source: Noodles
km: មី

source: Seafood
km: អាហារសមុទ្រ

source: Chicken
km: សាច់មាន់

source: Beef
km: សាច់គោ

source: Pork
km: សាច់ជ្រូក

source: Lamb
km: សាច់ចៀម

source: Fish
km: ត្រី

source: Shrimp
km: បង្កង

source: Crab
km: ក្តាម

source: Lobster
km: បង្កងដំរី

source: Sushi
km: ស៊ូស៊ី

source: Curry
km: ការី

source: Stir Fry
km: ឆាឆាឆា

source: Grilled
km: ដុត

source: Fried
km: ចៀន

source: Baked
km: ដុត

source: Steamed
km: ចំហុយ

source: Roasted
km: ដុត

source: Smoothie
km: ស្មូធី

source: Juice
km: ទឹកផ្លែឈើ

source: Coffee
km: កាហ្វេ

source: Tea
km: តែ

source: Water
km: ទឹក

source: Soda
km: ទឹកដោះគោ

source: Beer
km: ប៊ីយែរ

source: Wine
km: ស្រា

source: Cocktail
km: កូកថេល

source: Ice Cream
km: ការ៉េម

source: Cake
km: នំ

source: Cookie
km: ខូគី

source: Pie
km: នំផៃ

source: Pudding
km: ព័ត

source: Chocolate
km: សូកូឡា

source: Vanilla
km: វ៉ានីឡា

source: Strawberry
km: ផ្លែស្ត្របឺរី

source: Mango
km: ផ្លែស្វាយ

source: Banana
km: ផ្លែចេក

source: Apple
km: ផ្លែប៉ុម

source: Orange
km: ផ្លែក្រូច

source: Grape
km: ផ្លែទំពាំងបាយជូរ

source: Pineapple
km: ផ្លែម្នាស់

source: Coconut
km: ផ្លែដូង

source: Lemon
km: ផ្លែក្រូចឆ្មា

source: Lime
km: ផ្លែក្រូចឆ្មាខ្មៅ

source: Peach
km: ផ្លែផែក

source: Pear
km: ផ្លែដូងចាន់

source: Plum
km: ផ្លែព្រូន

source: Cherry
km: ផ្លែឈើឆ្លាត

source: Blueberry
km: ផ្លែប្លូបេរី

source: Raspberry
km: ផ្លែរ៉ាសបេរី

source: Blackberry
km: ផ្លែប្លេកបេរី

source: Cranberry
km: ផ្លែគ្រីនបេរី

source: Kiwi
km: ផ្លែគីវី

source: Papaya
km: ផ្លែល្ហុង

source: Guava
km: ផ្លែត្របែក

source: Dragon Fruit
km: ផ្លែឈើរាជវង្ស

source: Lychee
km: ផ្លែលីជី

source: Longan
km: ផ្លែម៉ាងហ្គូស្ទីន

source: Rambutan
km: ផ្លែរំបុត

source: Mangosteen
km: ផ្លែមង្គុស្តាំង

source: Durian
km: ផ្លែទុរេន

source: Jackfruit
km: ផ្លែខ្នុរ

source: Breadfruit
km: ផ្លែស្វាយចន្ទី

source: Soursop
km: ផ្លែគូរូប

source: Custard Apple
km: ផ្លែអាប៊ីដ

source: Sugar Apple
km: ផ្លែអាប៊ីដស្ករ

source: Cherimoya
km: ផ្លែឆេរីម៉ូយ៉ា

source: Sapodilla
km: ផ្លែសាប៊ូដីឡា

source: Star Fruit
km: ផ្លែផ្លែផ្កាយ

source: Carambola
km: ផ្លែការ៉ាមបូឡា

source: Persimmon
km: ផ្លែខាកខី

source: Fig
km: ផ្លែអង្ករ

source: Date
km: ផ្លែថ្ម

source: Prune
km: ផ្លែព្រូនខ្មៅ

source: Raisin
km: ផ្លែទំពាំងបាយជូរខ្មៅ

source: Currant
km: ផ្លែគឺរ៉ាន

source: Gooseberry
km: ផ្លែហ្គូសបេរី

source: Elderberry
km: ផ្លែអែលដឺបេរី

source: Mulberry
km: ផ្លែម៉ុលបេរី

source: Boysenberry
km: ផ្លែបយសែនបេរី

source: Loganberry
km: ផ្លែឡូហ្គានបេរី

source: Tayberry
km: ផ្លែតេបេរី

source: Marionberry
km: ផ្លែម៉ារីអនបេរី

source: Olallieberry
km: ផ្លែអូឡាលីបេរី

source: Youngberry
km: ផ្លែយ៉ាងបេរី

source: Dewberry
km: ផ្លែឌូបេរី

source: Wineberry
km: ផ្លែវ៉ាញបេរី

source: Cloudberry
km: ផ្លែខ្លាវបេរី

source: Salmonberry
km: ផ្លែសាមនបេរី

source: Thimbleberry
km: ផ្លែធីមបលបេរី

source: Bakeapple
km: ផ្លែបេកអាបល

source: Mora
km: ម៉ូរ៉ា

source: Zarzamora
km: ហ្សាហ្សាម៉ូរ៉ា

source: Amora
km: អាម៉ូរ៉ា

source: Morella
km: ម៉ូរែលឡា

source: Murra
km: មូរ៉ា

source: Murta
km: មូរតា

source: Mirtillo
km: ម៉ីរទីលឡូ

source: Mirtillo Nero
km: ម៉ីរទីលឡូ ណេរ៉ូ

source: Mirtillo Rosso
km: ម៉ីរទីលឡូ រ៉ូសូ

source: Mirtillo Giallo
km: ម៉ីរទីលឡូ ជៀលឡូ

source: Mirtillo Bianco
km: ម៉ីរទីលឡូ បៀអានខូ

source: Mirtillo Verde
km: ម៉ីរទីលឡូ វែរដេ

source: Mirtillo Blu
km: ម៉ីរទីលឡូ ប្លូ

source: Mirtillo Viola
km: ម៉ីរទីលឡូ វៀអូឡា

source: Mirtillo Rosa
km: ម៉ីរទីលឡូ រ៉ូសា

source: Mirtillo Arancione
km: ម៉ីរទីលឡូ អារ៉ានជីអូនេ

source: Mirtillo Marrone
km: ម៉ីរទីលឡូ ម៉ារ៉ូនេ

source: Mirtillo Grigio
km: ម៉ីរទីលឡូ ហ្គ្រីជីអូ
